RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/bl-mcal-gen/SysconfigGeneratedDpl/AM62Px.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM62Px" --package "AMH" --part "Default" --context "mcu-r5fss0-0" --product "MCU_PLUS_SDK_AM62Px@10.01.00"
 * @versions {"tool":"1.20.0+3587"}
 */

/**
 * Import the modules used in this configuration.
 */
const gpio       = scripting.addModule("/drivers/gpio/gpio", {}, false);
const gpio1      = gpio.addInstance();
const gpio2      = gpio.addInstance();
const gpio3      = gpio.addInstance();
const gpio4      = gpio.addInstance();
const gpio5      = gpio.addInstance();
const gpio6      = gpio.addInstance();
const gpio7      = gpio.addInstance();
const gpio8      = gpio.addInstance();
const gpio9      = gpio.addInstance();
const gpio10     = gpio.addInstance();
const gpio11     = gpio.addInstance();
const gpio12     = gpio.addInstance();
const gpio13     = gpio.addInstance();
const gpio14     = gpio.addInstance();
const gpio15     = gpio.addInstance();
const gpio16     = gpio.addInstance();
const gpio17     = gpio.addInstance();
const gpio18     = gpio.addInstance();
const gpio19     = gpio.addInstance();
const gpio20     = gpio.addInstance();
const gpio21     = gpio.addInstance();
const gpio22     = gpio.addInstance();
const gpio23     = gpio.addInstance();
const gpio24     = gpio.addInstance();
const gpio25     = gpio.addInstance();
const gpio26     = gpio.addInstance();
const gpio27     = gpio.addInstance();
const gpio28     = gpio.addInstance();
const gpio29     = gpio.addInstance();
const gpio30     = gpio.addInstance();
const gpio31     = gpio.addInstance();
const gpio32     = gpio.addInstance();
const gpio33     = gpio.addInstance();
const gpio34     = gpio.addInstance();
const gpio35     = gpio.addInstance();
const gpio36     = gpio.addInstance();
const gpio37     = gpio.addInstance();
const gpio38     = gpio.addInstance();
const gpio39     = gpio.addInstance();
const gpio40     = gpio.addInstance();
const gpio41     = gpio.addInstance();
const gpio42     = gpio.addInstance();
const gpio43     = gpio.addInstance();
const gpio44     = gpio.addInstance();
const gpio45     = gpio.addInstance();
const gpio46     = gpio.addInstance();
const gpio47     = gpio.addInstance();
const gpio48     = gpio.addInstance();
const gpio49     = gpio.addInstance();
const gpio50     = gpio.addInstance();
const gpio51     = gpio.addInstance();
const gpio52     = gpio.addInstance();
const gpio53     = gpio.addInstance();
const gpio54     = gpio.addInstance();
const gpio55     = gpio.addInstance();
const i2c        = scripting.addModule("/drivers/i2c/i2c", {}, false);
const i2c1       = i2c.addInstance();
const mcspi      = scripting.addModule("/drivers/mcspi/mcspi", {}, false);
const mcspi1     = mcspi.addInstance();
const mcspi2     = mcspi.addInstance();
const uart       = scripting.addModule("/drivers/uart/uart", {}, false);
const uart1      = uart.addInstance();
const uart2      = uart.addInstance();
const debug_log  = scripting.addModule("/kernel/dpl/debug_log");
const mpu_armv7  = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71 = mpu_armv7.addInstance();
const mpu_armv72 = mpu_armv7.addInstance();
const mpu_armv73 = mpu_armv7.addInstance();
const mpu_armv74 = mpu_armv7.addInstance();
const mpu_armv75 = mpu_armv7.addInstance();
const mpu_armv76 = mpu_armv7.addInstance();
const mpu_armv77 = mpu_armv7.addInstance();
const mpu_armv78 = mpu_armv7.addInstance();
const mpu_armv79 = mpu_armv7.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
gpio1.useMcuDomainPeripherals = false;
gpio1.$name                   = "DI_FALD_PG";
gpio1.GPIO.$assign            = "GPIO0";
gpio1.GPIO.gpioPin.$assign    = "GPMC0_DIR";

gpio2.pinDir                  = "OUTPUT";
gpio2.useMcuDomainPeripherals = false;
gpio2.$name                   = "DO_SOC_PWR_LATCH";
gpio2.GPIO.gpioPin.$assign    = "RGMII2_RD2";

gpio3.$name                   = "TEST_GPIO2";
gpio3.useMcuDomainPeripherals = false;
gpio3.pinDir                  = "OUTPUT";
gpio3.GPIO.gpioPin.$assign    = "RGMII2_RD3";

gpio4.$name                    = "DO_3V3_DISP";
gpio4.pinDir                   = "OUTPUT";
gpio4.MCU_GPIO.$assign         = "MCU_GPIO0";
gpio4.MCU_GPIO.gpioPin.rx      = false;
gpio4.MCU_GPIO.gpioPin.$assign = "PMIC_LPM_EN0";

gpio5.pinDir                  = "OUTPUT";
gpio5.$name                   = "DO_MD_TOUCH_RST";
gpio5.useMcuDomainPeripherals = false;
gpio5.GPIO.$assign            = "GPIO0";
gpio5.GPIO.gpioPin.rx         = false;
gpio5.GPIO.gpioPin.$assign    = "GPMC0_CSn0";

gpio6.$name                   = "DO_1V2_EN";
gpio6.pinDir                  = "OUTPUT";
gpio6.useMcuDomainPeripherals = false;
gpio6.GPIO.gpioPin.rx         = false;
gpio6.GPIO.gpioPin.$assign    = "RGMII2_RXC";

gpio7.$name                    = "DO_EN_5V";
gpio7.pinDir                   = "OUTPUT";
gpio7.MCU_GPIO.gpioPin.rx      = false;
gpio7.MCU_GPIO.gpioPin.$assign = "MCU_UART0_CTSn";

gpio8.$name                   = "DO_ENET_EN";
gpio8.pinDir                  = "OUTPUT";
gpio8.useMcuDomainPeripherals = false;
gpio8.GPIO.gpioPin.rx         = false;
gpio8.GPIO.gpioPin.$assign    = "RGMII2_TD2";

gpio9.$name                    = "DO_LIN_NSLP";
gpio9.pinDir                   = "OUTPUT";
gpio9.MCU_GPIO.gpioPin.rx      = false;
gpio9.MCU_GPIO.gpioPin.$assign = "WKUP_UART0_RTSn";

gpio10.$name                   = "DI_PMIC_INTN";
gpio10.useMcuDomainPeripherals = false;
gpio10.GPIO.gpioPin.rx         = false;
gpio10.GPIO.gpioPin.$assign    = "EXTINTn";

gpio11.$name                   = "DO_RTC_INTN";
gpio11.pinDir                  = "OUTPUT";
gpio11.useMcuDomainPeripherals = false;
gpio11.GPIO.gpioPin.rx         = false;
gpio11.GPIO.gpioPin.$assign    = "MMC2_SDCD";

gpio12.$name = "PMIC_INT";

gpio13.$name                   = "LED_LATCH";
gpio13.pinDir                  = "OUTPUT";
gpio13.useMcuDomainPeripherals = false;
gpio13.GPIO.$assign            = "GPIO0";
gpio13.GPIO.gpioPin.$assign    = "VOUT0_DATA11";

gpio14.$name                   = "LED_BLANK";
gpio14.useMcuDomainPeripherals = false;
gpio14.GPIO.$assign            = "GPIO0";
gpio14.GPIO.gpioPin.$assign    = "VOUT0_DATA10";

gpio15.$name                   = "LED_GCLK";
gpio15.pinDir                  = "OUTPUT";
gpio15.useMcuDomainPeripherals = false;
gpio15.GPIO.$assign            = "GPIO0";
gpio15.GPIO.gpioPin.$assign    = "VOUT0_DATA12";

gpio16.$name                   = "LED_ERR";
gpio16.useMcuDomainPeripherals = false;
gpio16.GPIO.$assign            = "GPIO0";
gpio16.GPIO.gpioPin.$assign    = "VOUT0_DATA13";

gpio17.$name                    = "PIN_WKUP_UART0_CTSN";
gpio17.pinDir                   = "OUTPUT";
gpio17.MCU_GPIO.gpioPin.rx      = false;
gpio17.MCU_GPIO.gpioPin.pu_pd   = "pu";
gpio17.MCU_GPIO.gpioPin.$assign = "WKUP_UART0_CTSn";

gpio18.$name                   = "DI_SBATT2_ERR";
gpio18.useMcuDomainPeripherals = false;
gpio18.GPIO.$assign            = "GPIO0";
gpio18.GPIO.gpioPin.$assign    = "GPMC0_ADVn_ALE";

gpio19.$name                   = "DI_MD_TOUCH_INTN";
gpio19.useMcuDomainPeripherals = false;
gpio19.GPIO.$assign            = "GPIO0";
gpio19.GPIO.gpioPin.$assign    = "GPMC0_CSn1";

gpio20.$name                   = "DI_BL_FAULT";
gpio20.useMcuDomainPeripherals = false;
gpio20.GPIO.$assign            = "GPIO0";
gpio20.GPIO.gpioPin.$assign    = "VOUT0_DATA8";

