RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/bl-mcal-gen/SysconfigGeneratedDpl/AM62Px.syscfg
gpio21.$name                   = "DI_SOC_FPDLINK3_LOCK";
gpio21.useMcuDomainPeripherals = false;
gpio21.GPIO.$assign            = "GPIO0";
gpio21.GPIO.gpioPin.$assign    = "MMC2_DAT2";

gpio22.$name                   = "DI_SOC_FPDLINK3_PASS";
gpio22.useMcuDomainPeripherals = false;
gpio22.GPIO.$assign            = "GPIO0";
gpio22.GPIO.gpioPin.$assign    = "MMC2_CLK";

gpio23.$name                   = "DI_ENET_MII_INT";
gpio23.useMcuDomainPeripherals = false;
gpio23.GPIO.$assign            = "GPIO0";
gpio23.GPIO.gpioPin.$assign    = "RGMII2_TD0";

gpio24.$name                   = "DI_IGN_MON";
gpio24.useMcuDomainPeripherals = false;
gpio24.GPIO.$assign            = "GPIO0";
gpio24.GPIO.gpioPin.$assign    = "RGMII2_TD1";

gpio25.$name                   = "DI_CABLE_DETECT";
gpio25.useMcuDomainPeripherals = false;
gpio25.GPIO.$assign            = "GPIO1";
gpio25.GPIO.gpioPin.$assign    = "RGMII2_RX_CTL";

gpio26.$name                   = "DI_TCON_IND_OUT";
gpio26.useMcuDomainPeripherals = false;
gpio26.GPIO.$assign            = "GPIO1";
gpio26.GPIO.gpioPin.$assign    = "MCASP0_ACLKX";

gpio27.$name                   = "DI_SPI_CAN_TCON_SDI";
gpio27.useMcuDomainPeripherals = false;
gpio27.GPIO.$assign            = "GPIO1";
gpio27.GPIO.gpioPin.$assign    = "SPI0_D1";

gpio28.$name                   = "DI_MCU_FALD_CONN_CHK";
gpio28.useMcuDomainPeripherals = false;
gpio28.GPIO.$assign            = "GPIO1";
gpio28.GPIO.gpioPin.$assign    = "RGMII2_RD0";

gpio29.$name                   = "DI_LDO_1V2_FAULTN";
gpio29.useMcuDomainPeripherals = false;
gpio29.GPIO.$assign            = "GPIO1";
gpio29.GPIO.gpioPin.$assign    = "RGMII2_RD1";

gpio30.$name                   = "DI_TFT_ER_DET";
gpio30.useMcuDomainPeripherals = false;
gpio30.GPIO.$assign            = "GPIO1";
gpio30.GPIO.gpioPin.$assign    = "MMC1_SDCD";

gpio31.$name                    = "DO_MCU_RESETSTAZ";
gpio31.pinDir                   = "OUTPUT";
gpio31.MCU_GPIO.$assign         = "MCU_GPIO0";
gpio31.MCU_GPIO.gpioPin.$assign = "MCU_RESETSTATz";

gpio32.$name                   = "DO_VPP_EN";
gpio32.pinDir                  = "OUTPUT";
gpio32.useMcuDomainPeripherals = false;
gpio32.GPIO.$assign            = "GPIO0";
gpio32.GPIO.gpioPin.rx         = false;
gpio32.GPIO.gpioPin.$assign    = "VOUT0_DATA2";

gpio33.$name                   = "DO_MD_GNSS_BOOT_EN";
gpio33.pinDir                  = "OUTPUT";
gpio33.useMcuDomainPeripherals = false;
gpio33.GPIO.$assign            = "GPIO0";
gpio33.GPIO.gpioPin.rx         = false;
gpio33.GPIO.gpioPin.$assign    = "VOUT0_DATA3";

gpio34.$name                   = "DO_MD_GNSS_RESETP";
gpio34.pinDir                  = "OUTPUT";
gpio34.useMcuDomainPeripherals = false;
gpio34.GPIO.$assign            = "GPIO0";
gpio34.GPIO.gpioPin.rx         = false;
gpio34.GPIO.gpioPin.$assign    = "VOUT0_DATA5";

gpio35.$name = "CONFIG_GPIO0";

gpio36.$name                   = "DO_MD_GNSS_PWR_EN";
gpio36.pinDir                  = "OUTPUT";
gpio36.useMcuDomainPeripherals = false;
gpio36.GPIO.$assign            = "GPIO0";
gpio36.GPIO.gpioPin.rx         = false;
gpio36.GPIO.gpioPin.$assign    = "VOUT0_DATA6";

gpio37.$name                   = "DO_BLU_OPAMP_PWR_EN";
gpio37.pinDir                  = "OUTPUT";
gpio37.useMcuDomainPeripherals = false;
gpio37.GPIO.$assign            = "GPIO0";
gpio37.GPIO.gpioPin.rx         = false;
gpio37.GPIO.gpioPin.$assign    = "VOUT0_DATA9";

gpio38.$name                   = "DO_BLU_DWALED_EN";
gpio38.pinDir                  = "OUTPUT";
gpio38.useMcuDomainPeripherals = false;
gpio38.GPIO.gpioPin.rx         = false;
gpio38.GPIO.gpioPin.$assign    = "VOUT0_DATA15";

gpio39.$name                   = "DO_TCON_BYPASS_MODE";
gpio39.pinDir                  = "OUTPUT";
gpio39.useMcuDomainPeripherals = false;
gpio39.GPIO.$assign            = "GPIO0";
gpio39.GPIO.gpioPin.rx         = false;
gpio39.GPIO.gpioPin.$assign    = "VOUT0_HSYNC";

gpio40.$name                   = "DO_TCON_BYPASS_SEL0";
gpio40.pinDir                  = "OUTPUT";
gpio40.useMcuDomainPeripherals = false;
gpio40.GPIO.$assign            = "GPIO0";
gpio40.GPIO.gpioPin.rx         = false;
gpio40.GPIO.gpioPin.$assign    = "VOUT0_DE";

gpio41.$name                   = "DO_TCON_BYPASS_SEL1";
gpio41.pinDir                  = "OUTPUT";
gpio41.useMcuDomainPeripherals = false;
gpio41.GPIO.$assign            = "GPIO0";
gpio41.GPIO.gpioPin.rx         = false;
gpio41.GPIO.gpioPin.$assign    = "VOUT0_VSYNC";

gpio42.$name                   = "DO_SOC_FPDLINK3_PDB";
gpio42.pinDir                  = "OUTPUT";
gpio42.useMcuDomainPeripherals = false;
gpio42.GPIO.$assign            = "GPIO0";
gpio42.GPIO.gpioPin.rx         = false;
gpio42.GPIO.gpioPin.$assign    = "MMC2_DAT1";

gpio43.$name                   = "DO_SOC_FPDLINK3_INTB";
gpio43.pinDir                  = "OUTPUT";
gpio43.useMcuDomainPeripherals = false;
gpio43.GPIO.$assign            = "GPIO0";
gpio43.GPIO.gpioPin.rx         = false;
gpio43.GPIO.gpioPin.$assign    = "MMC2_DAT0";

gpio44.$name                   = "DO_SOC_FPDLINK3_BISTEN";
gpio44.pinDir                  = "OUTPUT";
gpio44.useMcuDomainPeripherals = false;
gpio44.GPIO.$assign            = "GPIO0";
gpio44.GPIO.gpioPin.rx         = false;
gpio44.GPIO.gpioPin.$assign    = "MMC2_CMD";

gpio45.$name                   = "DO_ENET_RSTB";
gpio45.pinDir                  = "OUTPUT";
gpio45.useMcuDomainPeripherals = false;
gpio45.GPIO.$assign            = "GPIO0";
gpio45.GPIO.gpioPin.rx         = false;
gpio45.GPIO.gpioPin.$assign    = "RGMII2_TX_CTL";

gpio46.pinDir                  = "OUTPUT";
gpio46.useMcuDomainPeripherals = false;
gpio46.$name                   = "DO_EN_BUCK_FALD";
gpio46.GPIO.$assign            = "GPIO1";
gpio46.GPIO.gpioPin.rx         = false;

gpio47.$name                   = "DO_MCU_AMUX_S1";
gpio47.useMcuDomainPeripherals = false;
gpio47.pinDir                  = "OUTPUT";
gpio47.GPIO.$assign            = "GPIO1";
gpio47.GPIO.gpioPin.rx         = false;
gpio47.GPIO.gpioPin.$assign    = "MCASP0_AFSX";

gpio48.$name                   = "DO_MCU_AMUX_S0";
gpio48.pinDir                  = "OUTPUT";
gpio48.useMcuDomainPeripherals = false;
gpio48.GPIO.$assign            = "GPIO1";
gpio48.GPIO.gpioPin.rx         = false;
gpio48.GPIO.gpioPin.$assign    = "MCASP0_AFSR";

