RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/bl-mcal-gen/SysconfigGeneratedDpl/AM62Px.syscfg
gpio49.$name                   = "DO_TCON_SPI0_CS0";
gpio49.pinDir                  = "OUTPUT";
gpio49.useMcuDomainPeripherals = false;
gpio49.GPIO.$assign            = "GPIO1";
gpio49.GPIO.gpioPin.rx         = false;
gpio49.GPIO.gpioPin.$assign    = "SPI0_CS0";

gpio50.$name                   = "DO_SPI_CAN_CS";
gpio50.pinDir                  = "OUTPUT";
gpio50.useMcuDomainPeripherals = false;
gpio50.GPIO.$assign            = "GPIO1";
gpio50.GPIO.gpioPin.rx         = false;
gpio50.GPIO.gpioPin.$assign    = "SPI0_CS1";

gpio51.$name                   = "DESER_SPI1_DO";
gpio51.pinDir                  = "OUTPUT";
gpio51.useMcuDomainPeripherals = false;
gpio51.GPIO.$assign            = "GPIO1";
gpio51.GPIO.gpioPin.rx         = false;
gpio51.GPIO.gpioPin.$assign    = "MMC1_DAT3";

gpio52.$name                   = "DO_SOC_TCON_GRBN";
gpio52.pinDir                  = "OUTPUT";
gpio52.useMcuDomainPeripherals = false;
gpio52.GPIO.$assign            = "GPIO1";
gpio52.GPIO.gpioPin.rx         = false;
gpio52.GPIO.gpioPin.$assign    = "MMC1_DAT1";

gpio53.$name                   = "DO_TFT_CSB";
gpio53.pinDir                  = "OUTPUT";
gpio53.useMcuDomainPeripherals = false;
gpio53.GPIO.$assign            = "GPIO1";
gpio53.GPIO.gpioPin.rx         = false;
gpio53.GPIO.gpioPin.$assign    = "MMC1_SDWP";

gpio54.$name                    = "DO_TFT_BL_EN";
gpio54.pinDir                   = "OUTPUT";
gpio54.MCU_GPIO.$assign         = "MCU_GPIO0";
gpio54.MCU_GPIO.gpioPin.rx      = false;
gpio54.MCU_GPIO.gpioPin.$assign = "WKUP_CLKOUT0";

gpio55.$name = "CONFIG_GPIO1";

i2c1.$name               = "CONFIG_I2C0";
i2c1.bitRate             = "100KHZ";
i2c1.MCU_I2C.$assign     = "MCU_I2C0";
i2c1.MCU_I2C.SCL.$assign = "MCU_I2C0_SCL";
i2c1.MCU_I2C.SDA.$assign = "MCU_I2C0_SDA";
i2c1.I2C_child.$name     = "drivers_i2c_v0_i2c_v0_template0";

mcspi1.$name                           = "CONFIG_MCSPI0";
mcspi1.mcspiChannel[0].$name           = "CONFIG_MCSPI_CH0";
mcspi1.mcspiChannel[0].MCU_CSn.$assign = "MCU_SPI0_CS1";

mcspi2.$name                   = "CONFIG_MCSPI1";
mcspi2.useMcuDomainPeripherals = false;
mcspi2.pinMode                 = 3;
mcspi2.mcspiChannel[0].$name   = "CONFIG_MCSPI_CH1";
mcspi2.SPI.$assign             = "SPI2";

uart1.$name                = "CONFIG_UART0";
uart1.MCU_UART.$assign     = "MCU_USART0";
uart1.MCU_UART.RXD.$assign = "MCU_UART0_RXD";
uart1.MCU_UART.TXD.$assign = "MCU_UART0_TXD";

uart2.$name                      = "CONFIG_UART1";
uart2.useMcuDomainPeripherals    = false;
uart2.useWakeupDomainPeripherals = true;
uart2.WKUP_UART.$assign          = "WKUP_USART0";
uart2.WKUP_UART.RXD.$assign      = "WKUP_UART0_RXD";
uart2.WKUP_UART.TXD.$assign      = "WKUP_UART0_TXD";

debug_log.enableLogZoneError   = false;
debug_log.enableLogZoneWarning = false;
debug_log.enableCssLog         = false;

mpu_armv71.$name        = "CONFIG_MPU_REGION0";
mpu_armv71.attributes   = "CUSTOM";
mpu_armv71.tex          = 0;
mpu_armv71.isCacheable  = false;
mpu_armv71.isBufferable = false;
mpu_armv71.allowExecute = false;

mpu_armv72.$name        = "CONFIG_MPU_REGION1";
mpu_armv72.size         = 7;
mpu_armv72.attributes   = "CUSTOM";
mpu_armv72.isBufferable = false;

mpu_armv73.$name    = "CONFIG_MPU_REGION2";
mpu_armv73.size     = 19;
mpu_armv73.baseAddr = 0x79100000;

mpu_armv74.$name    = "CONFIG_MPU_REGION3";
mpu_armv74.size     = 21;
mpu_armv74.baseAddr = 0x70000000;

mpu_armv75.$name    = "CONFIG_MPU_REGION4";
mpu_armv75.size     = 31;
mpu_armv75.baseAddr = 0x80000000;

mpu_armv76.$name      = "CONFIG_MPU_REGION5";
mpu_armv76.size       = 15;
mpu_armv76.baseAddr   = 0x41010000;
mpu_armv76.attributes = "CUSTOM";
mpu_armv76.tex        = 0;

mpu_armv77.$name      = "CONFIG_MPU_REGION6";
mpu_armv77.size       = 15;
mpu_armv77.attributes = "CUSTOM";
mpu_armv77.tex        = 0;

mpu_armv78.$name        = "CONFIG_MPU_REGION7";
mpu_armv78.size         = 20;
mpu_armv78.baseAddr     = 0x9B800000;
mpu_armv78.attributes   = "CUSTOM";
mpu_armv78.tex          = 0;
mpu_armv78.isBufferable = false;
mpu_armv78.isCacheable  = false;
mpu_armv78.isShareable  = true;
mpu_armv78.allowExecute = false;

mpu_armv79.$name        = "CONFIG_MPU_REGION8";
mpu_armv79.attributes   = "CUSTOM";
mpu_armv79.isShareable  = true;
mpu_armv79.isCacheable  = false;
mpu_armv79.isBufferable = false;
mpu_armv79.size         = 20;
mpu_armv79.baseAddr     = 0x9B900000;
mpu_armv79.tex          = 0;
mpu_armv79.allowExecute = false;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
gpio2.GPIO.$suggestSolution              = "GPIO1";
gpio3.GPIO.$suggestSolution              = "GPIO1";
gpio6.GPIO.$suggestSolution              = "GPIO1";
gpio7.MCU_GPIO.$suggestSolution          = "MCU_GPIO0";
gpio8.GPIO.$suggestSolution              = "GPIO0";
gpio9.MCU_GPIO.$suggestSolution          = "MCU_GPIO0";
gpio10.GPIO.$suggestSolution             = "GPIO1";
gpio11.GPIO.$suggestSolution             = "GPIO0";
gpio12.MCU_GPIO.$suggestSolution         = "MCU_GPIO0";
gpio12.MCU_GPIO.gpioPin.$suggestSolution = "MCU_MCAN0_TX";
gpio17.MCU_GPIO.$suggestSolution         = "MCU_GPIO0";
gpio35.MCU_GPIO.$suggestSolution         = "MCU_GPIO0";
gpio35.MCU_GPIO.gpioPin.$suggestSolution = "MCU_UART0_RTSn";
gpio38.GPIO.$suggestSolution             = "GPIO0";
gpio46.GPIO.gpioPin.$suggestSolution     = "RGMII2_TD3";
gpio55.MCU_GPIO.$suggestSolution         = "MCU_GPIO0";
gpio55.MCU_GPIO.gpioPin.$suggestSolution = "MCU_SPI0_CS0";
mcspi1.MCU_SPI.$suggestSolution          = "MCU_SPI0";
mcspi1.MCU_SPI.CLK.$suggestSolution      = "MCU_SPI0_CLK";
mcspi1.MCU_SPI.D0.$suggestSolution       = "MCU_SPI0_D0";
mcspi1.MCU_SPI.D1.$suggestSolution       = "MCU_SPI0_D1";
mcspi2.SPI.CLK.$suggestSolution          = "MCASP0_ACLKR";
mcspi2.SPI.D0.$suggestSolution           = "MCASP0_AXR3";
mcspi2.SPI.D1.$suggestSolution           = "MCASP0_AXR2";
